The Z coordinate
  Namespace:   Autodesk.Revit.DB.PointClouds
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public float Z
  Visual Basic
Public Z As Single
  Visual C++
public:
float Z
 See Also
  CloudPoint Structure
  Autodesk.Revit.DB.PointClouds Namespace